In [1]:
import numpy as np
import pandas as pd
import datetime as dt

In [179]:
from IPython.core.display import display, HTML # Расширить рабочее поле ноутбука на весь экран
display(HTML("<style>.container { width:100% !important; }</style>"))

# Создание сводных таблиц

- Статья в документации pandas, посвященная изменению формы таблиц - https://pandas.pydata.org/docs/user_guide/reshaping.html
- Хороший туториал по этой теме - https://towardsdatascience.com/pandas-pivot-the-ultimate-guide-5c693e0771f3

In [78]:
data = pd.DataFrame([
            ['16-10-2021', '23:56:10', 'A', 'a1', '0001', np.random.randint(100)], 
            ['16-10-2021', '23:58:30', 'A', 'a1', '0002', np.random.randint(100)],
            ['16-10-2021', '23:58:35', 'B', 'b1', '0003', np.random.randint(100)],
            ['16-10-2021', '23:58:56', 'B', 'b2', '0004', np.random.randint(100)],
            ['16-10-2021', '23:59:21', 'C', 'c1', '0005', np.random.randint(100)],
            ['16-10-2021', '23:59:42', 'C', 'c1', '0006', np.random.randint(100)],

            ['17-10-2021', '00:03:05', 'A', 'a1', '0007', np.random.randint(100)],
            ['17-10-2021', '00:03:25', 'A', 'a2', '0008', np.random.randint(100)],
            ['17-10-2021', '00:03:48', 'A', 'a3', '0009', np.random.randint(100)],
            ['17-10-2021', '00:05:24', 'B', 'b1', '0010', np.random.randint(100)],
            ['17-10-2021', '00:05:36', 'B', 'b1', '0011', np.random.randint(100)],
            ['17-10-2021', '00:05:44', 'B', 'b2', '0012', np.random.randint(100)],
            ['17-10-2021', '00:06:03', 'B', 'b2', '0013', np.random.randint(100)],
            ['17-10-2021', '03:12:13', 'B', 'b3', '0014', np.random.randint(100)],
            ['17-10-2021', '03:12:46', 'C', 'c1', '0015', np.random.randint(100)],
            ['17-10-2021', '13:06:54', 'C', 'c1', '0016', np.random.randint(100)], 
            ['17-10-2021', '13:12:10', 'C', 'c2', '0017', np.random.randint(100)], 
            ['17-10-2021', '19:48:30', 'C', 'c2', '0018', np.random.randint(100)], 

            ['18-10-2021', '00:06:05', 'C', 'c1', '0019', np.random.randint(100)], 
            ['18-10-2021', '03:08:03', 'C', 'c2', '0020', np.random.randint(100)],
            ['18-10-2021', '12:07:08', 'C', 'c3', '0021', np.random.randint(100)],
    
            ['19-10-2021', '00:04:03', 'A', 'a1', '0022', np.random.randint(100)], 
            ['19-10-2021', '02:08:20', 'A', 'a2', '0023', np.random.randint(100)],
            ['19-10-2021', '10:03:08', 'B', 'a2', '0024', np.random.randint(100)],
            ['19-10-2021', '12:07:08', 'B', 'b1', '0025', np.random.randint(100)],
    
], columns=['str_date', 'str_time','group', 'sub_group','val_id', 'value'])

data['datetime'] = data.apply(lambda row:  dt.datetime.strptime(f'{row.str_date} {row.str_time}', '%d-%m-%Y %H:%M:%S'), axis=1)

data['date'] = data.datetime.dt.date
data['time'] = data.datetime.dt.time
data['week'] = data.datetime.dt.isocalendar().week # Получить номер недели

# data['weekday'] = data.datetime.dt.strftime('%A') 
data['weekday'] = data.datetime.dt.day_name() # Получить день недели (на английском)

datetime_cols = ['datetime', 'date','time','week','weekday']
group_cols = ['group', 'sub_group']
data = data[[*datetime_cols, *group_cols, 'val_id', 'value']]

data.head()

,datetime,date,time,week,weekday,group,sub_group,val_id,value
0,2021-10-16 23:56:10,2021-10-16,23:56:10,41,Saturday,A,a1,0001,98
1,2021-10-16 23:58:30,2021-10-16,23:58:30,41,Saturday,A,a1,0002,9
2,2021-10-16 23:58:35,2021-10-16,23:58:35,41,Saturday,B,b1,0003,75
3,2021-10-16 23:58:56,2021-10-16,23:58:56,41,Saturday,B,b2,0004,13
4,2021-10-16 23:59:21,2021-10-16,23:59:21,41,Saturday,C,c1,0005,53

In [202]:
simple_data = pd.DataFrame({
    'datetime': pd.date_range('1/1/2000', periods=9, freq='T'),
    'group' : ['A', 'A', 'A', 'B', 'B', 'B', 'C', 'C', 'C'],
    'sub_group': ['a','a', 'b','b','a','c','a','b','c'],
    'value': [1,2,5,3,4,2,1,5,4],
    'val_id': ['1000','1001','1002','1003','1004','1005','1006','1007','1008']
})

simple_data

             datetime group sub_group  value val_id
0 2000-01-01 00:00:00     A         a      1   1000
1 2000-01-01 00:01:00     A         a      2   1001
2 2000-01-01 00:02:00     A         b      5   1002
3 2000-01-01 00:03:00     B         b      3   1003
4 2000-01-01 00:04:00     B         a      4   1004
5 2000-01-01 00:05:00     B         c      2   1005
6 2000-01-01 00:06:00     C         a      1   1006
7 2000-01-01 00:07:00     C         b      5   1007
8 2000-01-01 00:08:00     C         c      4   1008

In [203]:
# Продублируем последнюю строку
wrong_simple_data = simple_data.append(simple_data.iloc[-1])
wrong_simple_data

             datetime group sub_group  value val_id
0 2000-01-01 00:00:00     A         a      1   1000
1 2000-01-01 00:01:00     A         a      2   1001
2 2000-01-01 00:02:00     A         b      5   1002
3 2000-01-01 00:03:00     B         b      3   1003
4 2000-01-01 00:04:00     B         a      4   1004
5 2000-01-01 00:05:00     B         c      2   1005
6 2000-01-01 00:06:00     C         a      1   1006
7 2000-01-01 00:07:00     C         b      5   1007
8 2000-01-01 00:08:00     C         c      4   1008
8 2000-01-01 00:08:00     C         c      4   1008

## Метод pivot()
- https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pivot.html

In [204]:
df1 = simple_data.set_index('datetime')
df1 = df1.pivot(columns='sub_group', values='value')
df1

sub_group              a    b    c
datetime
2000-01-01 00:00:00  1.0  NaN  NaN
2000-01-01 00:01:00  2.0  NaN  NaN
2000-01-01 00:02:00  NaN  5.0  NaN
2000-01-01 00:03:00  NaN  3.0  NaN
2000-01-01 00:04:00  4.0  NaN  NaN
2000-01-01 00:05:00  NaN  NaN  2.0
2000-01-01 00:06:00  1.0  NaN  NaN
2000-01-01 00:07:00  NaN  5.0  NaN
2000-01-01 00:08:00  NaN  NaN  4.0

#### В принципе pivot делает то же, что и эта команда
<img src="data/img/reshaping_unstack.png" width="500">

In [205]:
simple_data.set_index(["datetime", "sub_group"])["value"].unstack()

sub_group              a    b    c
datetime
2000-01-01 00:00:00  1.0  NaN  NaN
2000-01-01 00:01:00  2.0  NaN  NaN
2000-01-01 00:02:00  NaN  5.0  NaN
2000-01-01 00:03:00  NaN  3.0  NaN
2000-01-01 00:04:00  4.0  NaN  NaN
2000-01-01 00:05:00  NaN  NaN  2.0
2000-01-01 00:06:00  1.0  NaN  NaN
2000-01-01 00:07:00  NaN  5.0  NaN
2000-01-01 00:08:00  NaN  NaN  4.0

##### А вот если в индексах или колонках есть дубликаты - pivot ломается

In [206]:
df1 = wrong_simple_data.set_index('datetime')
try:
    df1 = df1.pivot(columns='sub_group', values='value')
except ValueError as error:
    print(f"Возникает ошибка: {error}")

Возникает ошибка: Index contains duplicate entries, cannot reshape

##### Поэтому имеет смысл пользоваться другим методом

## Метод pivot_table()
- https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html

In [207]:
wrong_simple_data

             datetime group sub_group  value val_id
0 2000-01-01 00:00:00     A         a      1   1000
1 2000-01-01 00:01:00     A         a      2   1001
2 2000-01-01 00:02:00     A         b      5   1002
3 2000-01-01 00:03:00     B         b      3   1003
4 2000-01-01 00:04:00     B         a      4   1004
5 2000-01-01 00:05:00     B         c      2   1005
6 2000-01-01 00:06:00     C         a      1   1006
7 2000-01-01 00:07:00     C         b      5   1007
8 2000-01-01 00:08:00     C         c      4   1008
8 2000-01-01 00:08:00     C         c      4   1008

In [208]:
df2 = wrong_simple_data.set_index('datetime')
df2 = df2.pivot_table(index='datetime', columns='sub_group', values='value', aggfunc='sum', fill_value=0)
df2

sub_group            a  b  c
datetime
2000-01-01 00:00:00  1  0  0
2000-01-01 00:01:00  2  0  0
2000-01-01 00:02:00  0  5  0
2000-01-01 00:03:00  0  3  0
2000-01-01 00:04:00  4  0  0
2000-01-01 00:05:00  0  0  2
2000-01-01 00:06:00  1  0  0
2000-01-01 00:07:00  0  5  0
2000-01-01 00:08:00  0  0  8

##### Механизм работы pivot_table больше напоминает эту команду.

In [209]:
wrong_simple_data.groupby(['datetime', 'sub_group'])['value'].sum().unstack().fillna(0)

sub_group              a    b    c
datetime
2000-01-01 00:00:00  1.0  0.0  0.0
2000-01-01 00:01:00  2.0  0.0  0.0
2000-01-01 00:02:00  0.0  5.0  0.0
2000-01-01 00:03:00  0.0  3.0  0.0
2000-01-01 00:04:00  4.0  0.0  0.0
2000-01-01 00:05:00  0.0  0.0  2.0
2000-01-01 00:06:00  1.0  0.0  0.0
2000-01-01 00:07:00  0.0  5.0  0.0
2000-01-01 00:08:00  0.0  0.0  8.0

##### Здесь агрегирующая функция - это sum. Но в принципе мы можем применить любую функцию

## С помощью метода stack можно свернуть сводную таблицу
<img src="data/img/reshaping_stack.png" width="500">

In [210]:
df2.stack()

datetime             sub_group
2000-01-01 00:00:00  a            1
                     b            0
                     c            0
2000-01-01 00:01:00  a            2
                     b            0
                     c            0
2000-01-01 00:02:00  a            0
                     b            5
                     c            0
2000-01-01 00:03:00  a            0
                     b            3
                     c            0
2000-01-01 00:04:00  a            4
                     b            0
                     c            0
2000-01-01 00:05:00  a            0
                     b            0
                     c            2
2000-01-01 00:06:00  a            1
                     b            0
                     c            0
2000-01-01 00:07:00  a            0
                     b            5
                     c            0
2000-01-01 00:08:00  a            0
                     b            0
                     c            8
dtype: int64

## Многомерная сводная таблица

In [211]:
data.pivot_table(
    index=['week', 'weekday'], 
    columns=['group', 'sub_group'], 
    values = 'value',
    aggfunc=[sum, np.mean],
    fill_value=0,
)

               sum                                         mean             \
group            A          B                  C              A          B
sub_group       a1  a2  a3 a2   b1   b2  b3   c1   c2  c3    a1  a2  a3 a2
week weekday
41   Saturday  107   0   0  0   75   13   0  116    0   0  53.5   0   0  0
     Sunday     82  40  18  0  166  101  22   82  134   0  82.0  40  18  0
42   Monday      0   0   0  0    0    0   0   23   83  10   0.0   0   0  0
     Tuesday     8  82   0  2   87    0   0    0    0   0   8.0  82   0  2


group                         C
sub_group      b1    b2  b3  c1  c2  c3
week weekday
41   Saturday  75  13.0   0  58   0   0
     Sunday    83  50.5  22  41  67   0
42   Monday     0   0.0   0  23  83  10
     Tuesday   87   0.0   0   0   0   0

In [212]:
data.pivot_table(
    index=['week', 'weekday'], 
    columns=['group', 'sub_group'], 
    #          col  | func
    aggfunc={'value': sum, 'val_id': 'nunique'},
    fill_value=0,
)

              val_id                            value                       \
group              A        B           C           A          B
sub_group         a1 a2 a3 a2 b1 b2 b3 c1 c2 c3    a1  a2  a3 a2   b1   b2
week weekday
41   Saturday      2  0  0  0  1  1  0  2  0  0   107   0   0  0   75   13
     Sunday        1  1  1  0  2  2  1  2  2  0    82  40  18  0  166  101
42   Monday        0  0  0  0  0  0  0  1  1  1     0   0   0  0    0    0
     Tuesday       1  1  0  1  1  0  0  0  0  0     8  82   0  2   87    0


group                C
sub_group      b3   c1   c2  c3
week weekday
41   Saturday   0  116    0   0
     Sunday    22   82  134   0
42   Monday     0   23   83  10
     Tuesday    0    0    0   0

## Вычисление суммы колонок и строк

In [213]:
simple_data.pivot_table(index='sub_group', columns='group', values='value', aggfunc='sum', 
                        margins=True, margins_name='Всего', 
                        fill_value=0)

group      A  B   C  Всего
sub_group
a          3  4   1      8
b          5  3   5     13
c          0  2   4      6
Всего      8  9  10     27

## Кастомные бины (интервалы) и автоматические квантили

In [222]:
simple_data['values_custom_bins'] = pd.cut(simple_data['value'], [0, 3, 5])
simple_data['auto_values_quantiles'] = pd.qcut(simple_data['value'], 2)
simple_data[['value', 'values_custom_bins', 'auto_values_quantiles', 'group','val_id']]

   value values_custom_bins auto_values_quantiles group val_id
0      1             (0, 3]          (0.999, 3.0]     A   1000
1      2             (0, 3]          (0.999, 3.0]     A   1001
2      5             (3, 5]            (3.0, 5.0]     A   1002
3      3             (0, 3]          (0.999, 3.0]     B   1003
4      4             (3, 5]            (3.0, 5.0]     B   1004
5      2             (0, 3]          (0.999, 3.0]     B   1005
6      1             (0, 3]          (0.999, 3.0]     C   1006
7      5             (3, 5]            (3.0, 5.0]     C   1007
8      4             (3, 5]            (3.0, 5.0]     C   1008

In [220]:
simple_data.pivot_table(index='values_custom_bins', columns='group', values='val_id', aggfunc='nunique')

group               A  B  C
values_custom_bins
(0, 3]              2  2  1
(3, 5]              1  1  2

### Временные бины

In [242]:
data['time_diff'] = data.datetime.diff().fillna(pd.Timedelta(0))
data.head()

,datetime,date,time,week,weekday,group,sub_group,val_id,value,time_diff,custom_time_bins
0,2021-10-16 23:56:10,2021-10-16,23:56:10,41,Saturday,A,a1,0001,98,0 days 00:00:00,NaN
1,2021-10-16 23:58:30,2021-10-16,23:58:30,41,Saturday,A,a1,0002,9,0 days 00:02:20,1-5minutes
2,2021-10-16 23:58:35,2021-10-16,23:58:35,41,Saturday,B,b1,0003,75,0 days 00:00:05,0-30seconds
3,2021-10-16 23:58:56,2021-10-16,23:58:56,41,Saturday,B,b2,0004,13,0 days 00:00:21,0-30seconds
4,2021-10-16 23:59:21,2021-10-16,23:59:21,41,Saturday,C,c1,0005,53,0 days 00:00:25,0-30seconds

In [245]:
time_bins = [
    pd.Timedelta(seconds = 0),
    pd.Timedelta(seconds = 30),
    pd.Timedelta(minutes = 1),
    pd.Timedelta(minutes = 5),
    pd.Timedelta(hours = 1),
    pd.Timedelta(hours = 2),
    pd.Timedelta(hours = 4),
    pd.Timedelta(hours = 6),
    pd.Timedelta(hours = 12),
    pd.Timedelta(hours = 18),
    pd.Timedelta(hours = 23),
    pd.Timedelta(days = 2),
    pd.Timedelta(days = 100)
]

labels = ['0-30seconds','30seconds-1minute', 
          '1-5minutes', '5minutes-1hours', 
          '1-2hours', '2-4hours', '4-6hours', '6-12hours', '12-18hours', '18-23hours', 
          '1-2 days', '2+ days']

simple_data['custom_time_bins'] = pd.cut(data['time_diff'], time_bins, labels = labels)
data.head(10)

,datetime,date,time,week,weekday,group,sub_group,val_id,value,time_diff,custom_time_bins
0,2021-10-16 23:56:10,2021-10-16,23:56:10,41,Saturday,A,a1,0001,98,0 days 00:00:00,NaN
1,2021-10-16 23:58:30,2021-10-16,23:58:30,41,Saturday,A,a1,0002,9,0 days 00:02:20,1-5minutes
2,2021-10-16 23:58:35,2021-10-16,23:58:35,41,Saturday,B,b1,0003,75,0 days 00:00:05,0-30seconds
3,2021-10-16 23:58:56,2021-10-16,23:58:56,41,Saturday,B,b2,0004,13,0 days 00:00:21,0-30seconds
4,2021-10-16 23:59:21,2021-10-16,23:59:21,41,Saturday,C,c1,0005,53,0 days 00:00:25,0-30seconds
5,2021-10-16 23:59:42,2021-10-16,23:59:42,41,Saturday,C,c1,0006,63,0 days 00:00:21,0-30seconds
6,2021-10-17 00:03:05,2021-10-17,00:03:05,41,Sunday,A,a1,0007,82,0 days 00:03:23,1-5minutes
7,2021-10-17 00:03:25,2021-10-17,00:03:25,41,Sunday,A,a2,0008,40,0 days 00:00:20,0-30seconds
8,2021-10-17 00:03:48,2021-10-17,00:03:48,41,Sunday,A,a3,0009,18,0 days 00:00:23,0-30seconds
9,2021-10-17 00:05:24,2021-10-17,00:05:24,41,Sunday,B,b1,0010,77,0 days 00:01:36,1-5minutes

# Практики

## Как посчитать значения значения за определенный временной период?

### Метод resample() 

В этом примере функция работает странно. Строки считаются неверно. А если предварительно заполнить пустые значения нулями - ответ меняется

In [290]:
df = simple_data.set_index('datetime')
df = df.pivot_table(index='datetime', columns='sub_group', values='val_id', aggfunc='nunique', fill_value=0)
df

sub_group            a  b  c
datetime
2000-01-01 00:00:00  1  0  0
2000-01-01 00:01:00  1  0  0
2000-01-01 00:02:00  0  1  0
2000-01-01 00:03:00  0  1  0
2000-01-01 00:04:00  1  0  0
2000-01-01 00:05:00  0  0  1
2000-01-01 00:06:00  1  0  0
2000-01-01 00:07:00  0  1  0
2000-01-01 00:08:00  0  0  1

In [291]:
tmp_count = df.resample('3min').sum()
tmp_count

sub_group            a  b  c
datetime
2000-01-01 00:00:00  2  1  0
2000-01-01 00:03:00  1  1  1
2000-01-01 00:06:00  1  1  1

#### В этом случае сохранится название индекса. Это можно исправить

In [292]:
tmp_count = tmp_count.reset_index()
tmp_count

sub_group            datetime  a  b  c
0         2000-01-01 00:00:00  2  1  0
1         2000-01-01 00:03:00  1  1  1
2         2000-01-01 00:06:00  1  1  1

In [278]:
tmp_count = tmp_count.rename_axis(None).rename_axis(None, axis=1)
tmp_count

             datetime  a  b  c
0 2000-01-01 00:00:00  2  1  0
1 2000-01-01 00:03:00  1  1  1
2 2000-01-01 00:06:00  1  1  1

In [279]:
sub_groups = sorted(simple_data.sub_group.unique())
tmp_count['date'] = tmp_count.datetime.dt.date
tmp_count['time'] = tmp_count.datetime.dt.strftime('%H:%M')
tmp_count['all'] = tmp_count[sub_groups].sum(axis=1)

tmp_count[['date','time','all', *sub_groups]]

         date   time  all  a  b  c
0  2000-01-01  00:00    3  2  1  0
1  2000-01-01  00:03    3  1  1  1
2  2000-01-01  00:06    3  1  1  1

### К сводным таблицам можно добавить heatmap

In [286]:
# Лучше заменить этот пример

tmp_count_styled = (
    tmp_count[['date','time','all', *sub_groups]]
            .style
            .format({col: "{}" for col in tmp_count.columns})
            .background_gradient(
                subset=sub_groups, # По каким колонкам считать heatmap 
                axis=1, # 0 - считать по колонкам, 1 - считать по строкам
                cmap='Greys' # выбор цвета
             )
)

tmp_count_styled